#+TITLE: File Logbook

This file is for testing the collection of log-books, links, and other meta-data
when a file is parsed. It should:

- collect logbooks from more than one heading
- Associate the meta-data (what heading the logbook came from)
- Sort the logbook time entries in descending date order.

 NOTE: Changing this file around will probably break tests.

* A headline with a normal log-book.
:LOGBOOK:
CLOCK: [2020-01-02 Thu 16:09]--[2020-01-02 Thu 16:20] =>  0:11
CLOCK: [2020-04-26 Sun 16:09]--[2020-04-26 Sun 18:20] =>  2:11
:END:

* A headline with an out-of-order log-book.
:LOGBOOK:
CLOCK: [2017-03-09 Thu 16:09]--[2017-03-09 Thu 18:20] =>  2:11
CLOCK: [2020-04-25 Sat 16:09]--[2020-04-25 Sat 16:20] =>  0:11
:END:
* A headline with some (2) links.

[[file:file1.org][A link to file1]]
[[https://www.wikipedia.org/][A link to wikipedia]]
